nerif-tafu/amaran-BLE-control/esp32-firmware/sdkconfig.defaults
# Target ESP32 classic (WROOM-32 / ESP-32S module). Chip has 4 MB flash.
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Bluetooth: use Bluedroid + BLE Mesh (the BLE Mesh stack is most mature on
# Bluedroid in IDF v5.3; NimBLE-on-mesh exists but is harder to drive).
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# BLE Mesh — node, not provisioner. We self-inject keys via internal APIs
# instead of getting provisioned by Sidus.
CONFIG_BLE_MESH=y
CONFIG_BLE_MESH_NODE=y
CONFIG_BLE_MESH_PB_ADV=y
CONFIG_BLE_MESH_PB_GATT=y
CONFIG_BLE_MESH_GATT_PROXY_SERVER=y
CONFIG_BLE_MESH_RELAY=y
CONFIG_BLE_MESH_SETTINGS=y
CONFIG_BLE_MESH_FRIEND=n
CONFIG_BLE_MESH_LOW_POWER=n

# Sizing — we have a single subnet (the studio mesh) and a single AppKey.
CONFIG_BLE_MESH_SUBNET_COUNT=1
CONFIG_BLE_MESH_APP_KEY_COUNT=2
CONFIG_BLE_MESH_MODEL_KEY_COUNT=2
CONFIG_BLE_MESH_MODEL_GROUP_COUNT=4
CONFIG_BLE_MESH_CRPL=20

# Larger main task stack since mesh init + AES-CCM uses some.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Wi-Fi: STA only, used for MQTT + HTTP API alongside BLE Mesh.
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP32_WIFI_NVS_ENABLED=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# HTTP server (for the REST API).
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Logging.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
